[
    {
        "title": "What a popular food or cooking opinion that you don't agree with?",
        "author": "Just_J3ssica",
        "timestamp": "2026-02-12T14:37:37+00:00",
        "permalink": "/r/Cooking/comments/1r2v2lw/what_a_popular_food_or_cooking_opinion_that_you/",
        "body": "I'll go first...\nKewpie mayo. I'm not a fan, but everyone else seems to love it and maybe even favor it over other options."
    },
    {
        "title": "Tuna Fish Sandwiches - Your Essential ingredient or technique?",
        "author": "FlyEaglesFlyauggie",
        "timestamp": "2026-02-12T20:44:43+00:00",
        "permalink": "/r/Cooking/comments/1r34wpr/tuna_fish_sandwiches_your_essential_ingredient_or/",
        "body": "I am trying to upgrade my tuna fish sandwich “game”. Other than the mayo and the tuna, you got an ingredient that you absolutely must add? Mine is 1/2 rib celery per can. How about a technique? Mine is refrigerating overnight.\nStill, my GF says it’s just “fine”, which is a polite way of her saying “meh”."
    },
    {
        "title": "Why are cod and catfish popular fish to deep fry compared to something like salmon or tuna?",
        "author": "Ill_Emu_4254",
        "timestamp": "2026-02-12T19:42:53+00:00",
        "permalink": "/r/Cooking/comments/1r33a88/why_are_cod_and_catfish_popular_fish_to_deep_fry/",
        "body": "Is it a cost thing or a flavor thing? My first thought was that maybe it's about how fatty the fish is, but Im not sure because I've never tried it before."
    },
    {
        "title": "Whats a guilty pleasure food you refuse to let go?",
        "author": "lilflo13",
        "timestamp": "2026-02-13T00:37:03+00:00",
        "permalink": "/r/Cooking/comments/1r3aokg/whats_a_guilty_pleasure_food_you_refuse_to_let_go/",
        "body": "By guilty pleasure I’m talking about Kraft mac & cheese or chef boyardee. Something you just won’t grow out of no matter how good of a cook you are"
    },
    {
        "title": "How do you properly velvet chicken?",
        "author": "_w00deye_",
        "timestamp": "2026-02-12T16:55:08+00:00",
        "permalink": "/r/Cooking/comments/1r2ypal/how_do_you_properly_velvet_chicken/",
        "body": "Every time I try to velvet chicken, all I can taste  the baking soda. I’ve tried using smaller amounts of baking soda, shorter soak times and it still tastes of baking soda. Maybe I’m just too sensitive to the taste of baking soda but I enjoy the taste and texture of velveted chicken when it’s in dishes from a Chinese restaurant.  Anyone have tips on velveting chicken without it having so much of the taste of baking soda?"
    },
    {
        "title": "How important is shaoxing wine? Can I make(ferment) a substitute that is most of the way there?",
        "author": "shiroe2001",
        "timestamp": "2026-02-12T19:31:56+00:00",
        "permalink": "/r/Cooking/comments/1r32zu2/how_important_is_shaoxing_wine_can_i_makeferment/",
        "body": "My brother brought over some lao gan ma from overseas for me to try and it tastes amazing. I had previously watched Chinese cooking demystified recipe for it and the wine seems to be the only ingredient I cannot get(Alcohol is banned in my country).\nThere is also this \"mirin-style sweet cooking seasoning\" would this work?"
    },
    {
        "title": "Best way to heat ~30 frozen breakfast sandwiches for a film crew",
        "author": "No_Kroger",
        "timestamp": "2026-02-12T22:25:35+00:00",
        "permalink": "/r/Cooking/comments/1r37ie7/best_way_to_heat_30_frozen_breakfast_sandwiches/",
        "body": "My brother is producing his first ever movie and I’ve been assigned breakfast duty for Day 1 of filming.\nBudget is tight (most of it went to production), so breakfast = 28 Jimmy Dean frozen breakfast sandwiches. Not glamorous, but we’re feeding a hungry crew at like 6am and I want them hot and ready at the same time. Hoping to avoid microwaving 2 at a time while everyone waits.\nThe box says microwave ~1min30sec per sandwich, but that obviously doesn’t scale well for ~30 sandwiches.\nEquipment I have access to at home:\n- Microwave\n- Standard oven\n- Stovetop\nAny tips on the best way to batch heat these so they come out hot (and ideally not soggy)? Oven method? Foil tent? Reassemble after heating? Open to any “catering hack” style advice.\nGoal: serve ~30 people quickly without turning the sandwiches into rubbery\nEdit: current idea/plan is microwave 2 at a time. Wrap them in foil. Put them in a baking sheet in the oven to stay warm. (No clue what oven temp would accomplish that)."
    },
    {
        "title": "Making chicken stock for the first time",
        "author": "Cold_Swordfish7763",
        "timestamp": "2026-02-13T00:10:40+00:00",
        "permalink": "/r/Cooking/comments/1r3a2x3/making_chicken_stock_for_the_first_time/",
        "body": "Bought a rotisserie chicken and once it is stripped I plan to use it to make stock. I am planning on using the below ingredients.\nDried carrots\nSweet onion chopped in big pieces\nDried bell pepper\nMince garlic\nMinced and powdered ginger\nBay leaf\nSalt and pepper\nDried chilis\nBetter than bouillon roasted garlic, savory vegetables and roasted chicken\nI am looking for any advice or tips on how to make this. Thanks in advance."
    },
    {
        "title": "How do you cook your sweet potatoes?",
        "author": "Eat_Carbs_OD",
        "timestamp": "2026-02-12T16:28:49+00:00",
        "permalink": "/r/Cooking/comments/1r2xzv7/how_do_you_cook_your_sweet_potatoes/",
        "body": "I need to lower my cholesterol so I am looking to change up my diet. Since I love sweet potatoes I was wondering how you guys like cooking yours.\nI normally just dice them up and spread them out onto a sheet pan, season them, and bake."
    },
    {
        "title": "Stove is broken, need ideas on making healthy meals",
        "author": "Willing-Committee481",
        "timestamp": "2026-02-12T18:01:27+00:00",
        "permalink": "/r/Cooking/comments/1r30id1/stove_is_broken_need_ideas_on_making_healthy_meals/",
        "body": "Alright, I’m living in a rented apartment and my electric stove has broken. Landlord is “on it” to get a technician out to fix it, but we’re on week two and I’m losing it. Me and the hubby have been eating lots of snacks and take out, but it’s becoming expensive. I’ve got a microwave, a small toaster oven and an electric kettle. I made a few salads but it’s the dead of winter right now, not ideal for making a salad appetizing. Thanks for your time :)"
    },
    {
        "title": "15-Bean and Ham Soup missing something...",
        "author": "ClementineCoda",
        "timestamp": "2026-02-12T17:33:38+00:00",
        "permalink": "/r/Cooking/comments/1r2zr2p/15bean_and_ham_soup_missing_something/",
        "body": "Stock made from ham bone and aromatics.  Bean mix soaked overnight (various beans, split peas, lentils...).   Onion, celery, carrot, garlic.  Pinch of sage.  Salt, pepper.  Chunks of ham.\nIt's fine.  Savory, hearty.  It's just missing something.\nAny suggestions?\nETA Lemon was the clear winner!  Really freshened and brightened it up.\nI did try a little vinegar in a small bowl, I could see that working but it wasn't as good as lemon.\nWorcestershire sauce / soy sauce didn't work for me.\nI think adding greens would work but I don't have any on hand.\nThanks everyone!"
    },
    {
        "title": "raw chicken!",
        "author": "clementineski",
        "timestamp": "2026-02-13T01:37:32+00:00",
        "permalink": "/r/Cooking/comments/1r3c08y/raw_chicken/",
        "body": "any tips for making sure nothing gets contaminated by raw chicken? when i cook, i feel like it gets everyywhere and i get so nervous and manically disinfect.\nhow do u suggest cleaning knives that touch raw chicken? what cutting board is best? (i know not wooden). any tips and tricks to ensure best and safest cooking?\nalso side note, how to make it more flavorful? i add lots of spices but it seems to not change much. ik marinating is an option. thank u!"
    },
    {
        "title": "Making dinner for family tonight and I want to impress them",
        "author": "TheFutureScaresMe333",
        "timestamp": "2026-02-13T00:08:18+00:00",
        "permalink": "/r/Cooking/comments/1r3a0z8/making_dinner_for_family_tonight_and_i_want_to/",
        "body": "I need recipe ideas. Preferably complicated enough that they'll be impressed but not so complicated I'll end up crying on the kitchen floor. Any ideas are welcome!"
    },
    {
        "title": "When making a pizza from scratch, how do you get it so the cheese melts on top rather than into the sauce?",
        "author": "cherry-care-bear",
        "timestamp": "2026-02-12T00:21:38+00:00",
        "permalink": "/r/Cooking/comments/1r2ek6v/when_making_a_pizza_from_scratch_how_do_you_get/",
        "body": "I'm a slight bit sick of chain pizza so want to make my own. However, when attempting this in the past, the cheese always settled into the sauce rather than cooking on top of it.\nAny tips would be greatly appreciated."
    },
    {
        "title": "Looking for simple meals that reheat well.",
        "author": "AccomplishedDish5649",
        "timestamp": "2026-02-12T21:49:19+00:00",
        "permalink": "/r/Cooking/comments/1r36ky0/looking_for_simple_meals_that_reheat_well/",
        "body": "Here’s my dilemma, I have to cook twice a week as a meal prep for the following 2-3 days. I rent a room in a small house with a women 3x my age who told me with her own words that she hates sharing a space but needs the money. I have 1/3 of a shelf in the pantry, half of a shelf in the fridge and no space in my room or her garage for a mini-fridge (not even a really small one), and quite literally NO freezer room (NONE). When I buy meat, it has to be cooked within 2 days because the freezer isn’t an option. When I buy something frozen to cook, I have to take it straight home to cook. I have to cook about enough for a few days and the container can’t be huge because I’m working with virtually half a shelf of fridge space. I need to use everything I’m cooking with for each singular time, save for spices and whatnot, but all ingredients have to be exactly enough for the amount I’m cooking and the rest is thrown out because it’ll use up too much space. And it has to reheat well for future meals.\nI cook every Monday and Thursday night and eat out 2x a week after church and after work w a coworker, and it’s the same stuff but I need new ideas. Here’s my list:\n- Small batch of enchiladas (6) (Sam’s club)\n- Taco salad\n- Spaghetti bolognese\n- Tacos on flour tortillas\n- Batch of stuffed bell peppers (4)\n- Chili\nNeed more, help!!! I’m open to frozen stuff as long as it’s not super spacious. And canned or pre-made stuff."
    },
    {
        "title": "Am I the only person who spends multiple hrs cooking in the kitchen and by the time everything is done and ready I've completely lost my appetite?? What the hell...",
        "author": "esssi_",
        "timestamp": "2026-02-12T00:56:35+00:00",
        "permalink": "/r/Cooking/comments/1r2fcz6/am_i_the_only_person_who_spends_multiple_hrs/",
        "body": "​"
    },
    {
        "title": "What kind of school is Le Cordon Bleu?",
        "author": "Puzzleheaded-Law-616",
        "timestamp": "2026-02-12T01:10:23+00:00",
        "permalink": "/r/Cooking/comments/1r2fo19/what_kind_of_school_is_le_cordon_bleu/",
        "body": "I asked the same question on another server before. I have the opportunity to study at Le Cordon Bleu in my country with a full scholarship, but for some reason most of the reviews were negative. What do you think? Should I go? (I won't pay any money to school, I'll have a full scholarship)"
    },
    {
        "title": "Use for Leftover Slow Cooker Broth?",
        "author": "Tableaux_Esoterica",
        "timestamp": "2026-02-12T21:56:39+00:00",
        "permalink": "/r/Cooking/comments/1r36rky/use_for_leftover_slow_cooker_broth/",
        "body": "Hello. I save my juices from slow cooker recipes. When they are chilled and separate, the top layer of fat can be pried off like a hockey puck and used as an oil in the frying pan. But then what? My most recent juice from an oxtail recipe is more of a gelatinous pudding than the brothy liquid I was expecting. What should I do with that? Could I let is warm up and liquefy and then use it as a marinade (I was thinking for porkchops). Can I also use the jelly as an oil when I fry vegetables, etc. in a frying pan? Or is it really just waste product I should throw out?\nThanks."
    },
    {
        "title": "Can meatloaf become meatballs?",
        "author": "sf-echo",
        "timestamp": "2026-02-12T21:09:34+00:00",
        "permalink": "/r/Cooking/comments/1r35k71/can_meatloaf_become_meatballs/",
        "body": "Before I do a whole experiment: if I have a meatloaf recipe, could I just form it into balls and bake, instead of putting all the mix into a loaf pan? Or is the standard meatloaf composition too loose, and I need to adjust the recipe to have more binder?"
    },
    {
        "title": "Orange Sauce - Ingredient Swap?",
        "author": "starlightvortex",
        "timestamp": "2026-02-12T22:19:17+00:00",
        "permalink": "/r/Cooking/comments/1r37coi/orange_sauce_ingredient_swap/",
        "body": "Hi! So, I tried finding information about this online, but nothing seemed to come up.\nCan I use orange extract to make orange sauce?\nI don't have orange juice, marmalade, fresh oranges, or any other source of the flavor that I've found listed in recipes. But I\ndo\nhave a small bottle of orange extract I picked up for baking a couple months ago.\nI want to think this would provide the flavor, and it's probably more concentrated than anything else, so I wouldn't need a lot? But that's where I start seeing issues - The recipes I've seen usually call for around a cup or more of these ingredients, depending which is being used. Swapping that for a bit of extract would definitely change the consistency of the sauce, and the amount produced.\nIf the extract covers the flavor profile, what would need to be changed or added to maintain other aspects of the sauce? I'm not too experienced in making sauces from scratch, otherwise I'd probably just start experimenting with it.\nI'm confident I have every other ingredient I'd need. I'm aware that the extract might produce a more artificial flavor than other sources of orange, I'm not really concerned with it. I'm just wondering if this is a substitution that can be done?"
    },
    {
        "title": "Last time you made an outstanding meal? What was it?",
        "author": "Ghostly-Mouse",
        "timestamp": "2026-02-12T20:05:39+00:00",
        "permalink": "/r/Cooking/comments/1r33w2k/last_time_you_made_an_outstanding_meal_what_was_it/",
        "body": "My idea of an outstanding meal is where every aspect of each piece works so well together you can’t imagine changing it for the better.\nLast night I made one of those meals.  I had not paired exactly these things before, but will make the pairing again!  Pan fried pork schnitzel -air fried rosemary, paprika, and garlic new potatoes, carrots, zucchini, mini sweet peppers and onions -air fried “honey sweet” baked apples with butter and cinnamon sugar to make almost a caramel inside the apple cavity.  This came together in under half an hour and I can’t remember a better meal in quite awhile.\nWhat is your “wouldn’t change a thing” meal of late?"
    },
    {
        "title": "I've toasted the hazelnut meal too much. It's not burnt. Any recipe suggestions to use it up?",
        "author": "Far_Minimum3743",
        "timestamp": "2026-02-12T21:57:16+00:00",
        "permalink": "/r/Cooking/comments/1r36s5s/ive_toasted_the_hazelnut_meal_too_much_its_not/",
        "body": "I made some hazelnut pavlova.  I usually toast the hazelnut meal but I toasted it too much.  It’s mildly bitter but I prefer not to add to my pavlova.  Are there any other uses for toasted hazelnut meal?"
    },
    {
        "title": "I have hundreds of oranges and need ideas/recipes of things to make after juice and marmalade!",
        "author": "LizaBlue4U",
        "timestamp": "2026-02-11T22:23:55+00:00",
        "permalink": "/r/Cooking/comments/1r2bo40/i_have_hundreds_of_oranges_and_need_ideasrecipes/",
        "body": "I have a navel orange tree and a tangelo tree in my backyard. Both are dwarf trees, but they've really outdone themselves this year. Each tree has well over 100 and it's just me and my husband.\nPlease note:\nLocal food pantrys will not take them\nbecause we have a quarantine in our county due to fruit fly problem which mandates that homegrown fruit can not be taken off the property.\nWe've already juiced\na ton and cannot drink or store any more.\nI've already made lots of marmalade\n. 4 oranges makes 9 jars, so we've got plenty and everyone we know is getting some.\nOther ideas?"
    },
    {
        "title": "Does anyone else get an ick from overly touched food",
        "author": "Elina299",
        "timestamp": "2026-02-13T01:35:24+00:00",
        "permalink": "/r/Cooking/comments/1r3bym9/does_anyone_else_get_an_ick_from_overly_touched/",
        "body": "What I mean is, when watching reels, I see people making things like candy roses by stacking them on a stick. I would never feel comfortable eating that because the sticky candy has been handled by some random hands and I don’t know if those hands are clean.\nIt's the same with those XL cakes with lots of fondant and details. I just visualize how many times the person must have touched it with their fingertips or how many times they might have scratched their forehead or touched another surface without washing their hands. Or even when someone is placing a piece of cake onto my plate but touches it from the side so it doesn’t fall.\nGenerally, I don’t accept any type of food or cookies from people with dogs because I imagine the dog licked their hand and they didn’t wash it. Or people with many toddlers. Or smoker households because then the flour has that taste of those oddly scented rooms. I wash my hands a thousand times when I'm baking or cooking and I doubt others do the same. I’m certain there are some like-minded peepsnlike me out there, hiding their unpopular food ick opinions!"
    },
    {
        "title": "Which multicooker should I buy ?",
        "author": "MissCinderellaa",
        "timestamp": "2026-02-12T19:36:24+00:00",
        "permalink": "/r/Cooking/comments/1r3342j/which_multicooker_should_i_buy/",
        "body": "Hello, I've been researching multicookers for a while now and I'm wondering which one would be best.\nI really want a multicooker with a large capacity, an air fryer function, a steaming function, and a rice cooking function. \nBut obviously, the more functions, the better. \nI need one device that will replace several appliances and allow me to prepare healthy meals for my family.\nI was thinking about buying Ninja Combi 12-in-1 SFP700EU , Ninja Foodi or Ninja Speedi. \nBut I don't really know which one to choose, or maybe someone could recommend better multicookers?"
    },
    {
        "title": "Pan seared tomatoes",
        "author": "baby_kayyann",
        "timestamp": "2026-02-12T16:43:51+00:00",
        "permalink": "/r/Cooking/comments/1r2yeab/pan_seared_tomatoes/",
        "body": "I’m wanting to make pan seared tomatoes and mushrooms apart of an Old English Breakfast for my book club(we’re reading Pride and Prejudice). what are the best tomatoes to pan sear as if i’m in the early 19th-century British Regency era?"
    },
    {
        "title": "Valentine’s Day dinner ideas",
        "author": "Consistent-Post-5300",
        "timestamp": "2026-02-12T21:40:13+00:00",
        "permalink": "/r/Cooking/comments/1r36cqp/valentines_day_dinner_ideas/",
        "body": "Does anyone have any tried and tested dishes which look super fancy? We don’t have any dietary restrictions and I really want to make an effort rather than taking her out to dinner."
    },
    {
        "title": "What can I make with rice noodles",
        "author": "Delicious_Fee_2636",
        "timestamp": "2026-02-13T01:16:16+00:00",
        "permalink": "/r/Cooking/comments/1r3bjvx/what_can_i_make_with_rice_noodles/",
        "body": ""
    },
    {
        "title": "Website to finish multiple meals at one time",
        "author": "Joey_Rigatoni_",
        "timestamp": "2026-02-12T19:02:33+00:00",
        "permalink": "/r/Cooking/comments/1r327cu/website_to_finish_multiple_meals_at_one_time/",
        "body": "I am getting more and more into cooking, and I am making my boyfriend a big valentines day dinner. I can make the dishes, no problem; however, I am not great at timing it so all the dishes are finished and ready to eat/hot at the same time. Is there a website that tells you step by step when to start each dish so they can all be done at the same time? I appreciate it!"
    },
    {
        "title": "Silicone ice cube trays",
        "author": "Callan_LXIX",
        "timestamp": "2026-02-12T21:07:29+00:00",
        "permalink": "/r/Cooking/comments/1r35i5z/silicone_ice_cube_trays/",
        "body": "Okay, so I've tried a few different brands of silicone ice cube trays.\nI like how they work except I keep getting an off flavor that develops within a few weeks of using.\nI have bought the cheap ones from China and I bought the expensive ones that are supposed to be more pure and better quality here in the States and they both have developed the same issue.\nDoes anyone have a better recommendation of either optimal brand, or ways to prevent that effect?\nI have thought of trying to use a non-wovern fabric pocket of some kind and have both activated charcoal and baking soda in two different 'pockets', if that would improve my odds?\n(I just need to try to find non-woven fabric pieces and put it together to make it worth my while and to have something that can be refillable and reuseable)"
    },
    {
        "title": "Sauce or Dressings Options",
        "author": "DifferentKindOfBuzz",
        "timestamp": "2026-02-13T00:34:43+00:00",
        "permalink": "/r/Cooking/comments/1r3amor/sauce_or_dressings_options/",
        "body": "Hello, I'm seeking out sauce recipes to punch up my flavors and/or bind ingredients together. Unfortunately I strongly dislike some basic elements: salad dressing, vinegar, mayo.\nAs an example, I had a dish of chicken with roasted brussel sprouts and quinoa the other night. It taste good but was a little dry as left overs. Or cold examples I'd want something for would be a green salad or dense bean \"salad\".\nDoes anyone have a sauce or dressing recipes without the mayo and vinegar? Or has anyone found a good substitute for one of these elements? Thank you for the help!"
    },
    {
        "title": "What are some high calorie high protein meals that are easy to make that don’t taste like bodybuilding slop?",
        "author": "goobert333",
        "timestamp": "2026-02-13T00:27:12+00:00",
        "permalink": "/r/Cooking/comments/1r3agff/what_are_some_high_calorie_high_protein_meals/",
        "body": "Im a student and rarely find time to cook meals but i need a lot of energy and protein to keep my brain powered up.\nDo any of you have anything in mind that is somewhat easy and fast, tastes decent, and is very calorie dense and high in protein?"
    },
    {
        "title": "What do you do with the last chunk of nutmeg after microplaning the rest?",
        "author": "TbonerT",
        "timestamp": "2026-02-12T20:41:15+00:00",
        "permalink": "/r/Cooking/comments/1r34tlu/what_do_you_do_with_the_last_chunk_of_nutmeg/",
        "body": "I made some fettuccine Alfredo and I’m down to a little nub of nutmeg but I’m not comfortable microplaning any more of it. What should I do with it?"
    },
    {
        "title": "What to do with 4kg of boneless beef short rib?",
        "author": "masegesege_",
        "timestamp": "2026-02-13T00:22:47+00:00",
        "permalink": "/r/Cooking/comments/1r3acvs/what_to_do_with_4kg_of_boneless_beef_short_rib/",
        "body": "I have 4kg of boneless beef short rib. It’s huge.\nMy current plan is to grill it like a brisket - uncovered s&p for an hour, covered for 4+, uncovered again to reset the crust.\nAm I missing anything? What should I look out for? Any other ideas?\nI’ve been told this is a fairly forgiving cut so I’m not too worried, but it’s not everyday you have 4kg of delicious beef so I wanna be sure I make the most of it!\nEdit: I should also mention that my kitchen appliances are limited. I’m in Asia, we don’t have ovens."
    },
    {
        "title": "Brasied lamb leg use",
        "author": "turtlewaxsoup",
        "timestamp": "2026-02-12T14:37:34+00:00",
        "permalink": "/r/Cooking/comments/1r2v2jl/brasied_lamb_leg_use/",
        "body": "I braised a lamb leg and have most of it left and trying to figure out another way to use it.  Does anyone have any recipe recommendations?  I also saved the braising liquid so maybe some sort of pie or noodles/Ramen?"
    },
    {
        "title": "Help me put these ingredients together to make a delicious dinner!",
        "author": "FaithlessnessRare416",
        "timestamp": "2026-02-12T23:59:56+00:00",
        "permalink": "/r/Cooking/comments/1r39tio/help_me_put_these_ingredients_together_to_make_a/",
        "body": "I have leftover pulled pork shoulder from Aldi, corn tortillas, eggs, cilantro, garlic, enchilada sauce (red) and cheese. I really want to use scrambled eggs in this dish, but I cannot find an enchilada recipe that uses eggs as a filling, at least not one that sounds good to me. Does anyone have tips for me? I’ve never made enchiladas, btw."
    },
    {
        "title": "Dough still raw, what am I doing wrong?",
        "author": "Historical_Sand7487",
        "timestamp": "2026-02-12T23:35:26+00:00",
        "permalink": "/r/Cooking/comments/1r398v5/dough_still_raw_what_am_i_doing_wrong/",
        "body": "So I get this refrigerated pizzas from Aldi for like 8 bucks, they're great.  But I've never successfully cooked them all the way through.  It says 400 degrees for 16-18 minutes.  I did 420 degrees for 27 minutes and dough is still raw but toppings are quite well done.  Not sure I can cook it any longer... Any suggestions???"
    },
    {
        "title": "Garbanzo beans safe to eat?",
        "author": "Obatala_",
        "timestamp": "2026-02-12T23:32:32+00:00",
        "permalink": "/r/Cooking/comments/1r396fx/garbanzo_beans_safe_to_eat/",
        "body": "I was going to make garbanzo bean stew yesterday, so I did an overnight soak and took the beans out yesterday morning. But I ended up having car trouble, so the garbanzo beans have been on my counter for 24 hours post soak.  They now have little sprouts coming out of half the beans.\nIs this still edible/safe to cook with?  And if not, can I put them out for the creatures in the garden, or should it be tossed?\nThanks!"
    },
    {
        "title": "Anyone got any tricks on how to get sliced beetroot out of the jar without staining everything purple? I use a fork but I generally make a mess and I can't figure out what would work better.",
        "author": "RohanODuill",
        "timestamp": "2026-02-12T23:27:28+00:00",
        "permalink": "/r/Cooking/comments/1r39209/anyone_got_any_tricks_on_how_to_get_sliced/",
        "body": ""
    },
    {
        "title": "Beef Stock problems",
        "author": "Chairman69",
        "timestamp": "2026-02-12T19:40:13+00:00",
        "permalink": "/r/Cooking/comments/1r337nu/beef_stock_problems/",
        "body": "I’ve made beef stock in the past in the crockpot without issues so i understand the general process, however my crockpot lid broke so I turned to making it in a pot. I had it simmering for about 2 hours without issue, so i went to the store to grab something and when i came back my stock had reduced pretty heavily. I added a little bit of water so i could have a usable yield but after tasting it im worried im not getting alot of flavor. Should I just restart my stock or is it just too early for it to be developing alot of flavor?"
    },
    {
        "title": "How to freeze potatoes to heat up in the microwave?",
        "author": "caviarandtwinkies",
        "timestamp": "2026-02-12T15:34:15+00:00",
        "permalink": "/r/Cooking/comments/1r2wk8a/how_to_freeze_potatoes_to_heat_up_in_the_microwave/",
        "body": "Hi\nr/Cooking\n. I really like with the “smart ones broccoli cheddar roasted potatoes.” However they’re quite costly at my local store and I feel like for something made of cheese, broccoli and potatoes, I would be better off figuring out how to make it on my own.\nI want to be able to heat these up in the microwave at work or in a pinch when I am running from place to place. I work pretty long hours, so meal prepping them in to have in fridge is not something I want to do.\nI’ve googled but it seems everywhere is giving me different info as far as how to freeze the potatoes.\nDoes anyone have a tried and true method?"
    },
    {
        "title": "Unexpected Hawaiian bread",
        "author": "TBHICouldComplain",
        "timestamp": "2026-02-12T19:01:06+00:00",
        "permalink": "/r/Cooking/comments/1r325wm/unexpected_hawaiian_bread/",
        "body": "So…. I got Hawaiian bread in my grocery order instead of the hamburger buns I ordered. I have no idea what to do with it beyond maybe French toast? I’m the only one in the house who eats French toast though and I definitely can’t eat a whole loaf’s worth.\nI could freeze it for later but to do what with later? What do y’all do with Hawaiian bread?\nEdit: It’s a presliced loaf of Hawaiian bread not Hawaiian rolls."
    },
    {
        "title": "What to do with a large amount of pork rinds?",
        "author": "AttemptVegetable",
        "timestamp": "2026-02-12T18:53:43+00:00",
        "permalink": "/r/Cooking/comments/1r31yi5/what_to_do_with_a_large_amount_of_pork_rinds/",
        "body": "Ordered pickup from my local Mexican market asking for 2lb of pork rinds. They gave me five but only charged me for two."
    },
    {
        "title": "Salad prep items?",
        "author": "mapett",
        "timestamp": "2026-02-12T13:50:53+00:00",
        "permalink": "/r/Cooking/comments/1r2txzv/salad_prep_items/",
        "body": "I love salads, but feel like I have to cut up everything fresh, and it is time consuming. What are some components I can cut up one day and use through the next 4 days or so? Also how to best store the item would be helpful."
    },
    {
        "title": "What should I do? I need advice for Eclairs.",
        "author": "Unlucky-Witness7051",
        "timestamp": "2026-02-12T22:34:44+00:00",
        "permalink": "/r/Cooking/comments/1r37qp8/what_should_i_do_i_need_advice_for_eclairs/",
        "body": "Hey guys, im a teenager planning to bring some eclairs to school for valentines day. The plan is tonight to make the shells, and tomorrow melt chocolate and put it in a thermos, as well as making the cream and putting it in cold packs. Would this work? Theoretically i can fill their shells and then let them dip it in chocolate.\nWould this work?"
    },
    {
        "title": "White Spice Pound Cake?",
        "author": "No-Type119",
        "timestamp": "2026-02-12T18:39:10+00:00",
        "permalink": "/r/Cooking/comments/1r31k2l/white_spice_pound_cake/",
        "body": "I am looking for a lost recipe from an old Southern Living magazine. I think it was called white spice pound cake, and it used the lighter colored spices  like cardamom, mace, ginger and white pepper. It had an unusual but delicious flavor. It was baked in a bread tin. Does anyone have a recipe like this?"
    },
    {
        "title": "Ginger ponzu recipe from “How to Cook the Finest Things in the Sea” cookbook by Ari Kolender (owner of found oyster, queens in Los Angeles)",
        "author": "Ok_Amount_9250",
        "timestamp": "2026-02-12T16:21:33+00:00",
        "permalink": "/r/Cooking/comments/1r2xsyw/ginger_ponzu_recipe_from_how_to_cook_the_finest/",
        "body": "Hi! I need help! I really want to make the ginger ponzu recipe from Ari Kolender’s cookbook. I’m making a dish for Valentine’s Day but I’m not able to get the book in time. If someone shares the recipe I will share recipes in return when I get my hands on the book :)"
    },
    {
        "title": "Cooking blog/recipe sites that have a very high “HIT” rate versus “miss” - need recipes I can trust",
        "author": "Libz0724",
        "timestamp": "2026-02-11T17:51:16+00:00",
        "permalink": "/r/Cooking/comments/1r24a4g/cooking_blogrecipe_sites_that_have_a_very_high/",
        "body": "Hi all. Too often I run into the issue of making a recipe I find online, and a lot of times even if it has good reviews, it’s not good. And it’s not because I can’t cook. 😂 What sites do you all recommend that you find the recipes are almost always good versus recipes that are just meh?"
    },
    {
        "title": "What do I do with all this soup???",
        "author": "saltyspatoon96",
        "timestamp": "2026-02-12T13:55:38+00:00",
        "permalink": "/r/Cooking/comments/1r2u23e/what_do_i_do_with_all_this_soup/",
        "body": "Accidentally bought a bunch of cream of mushroom soup instead of chicken noodle. What are some things I can make with it??"
    },
    {
        "title": "Replacing all our pantry spices and hebs",
        "author": "Master-Map1382",
        "timestamp": "2026-02-12T21:11:26+00:00",
        "permalink": "/r/Cooking/comments/1r35lz9/replacing_all_our_pantry_spices_and_hebs/",
        "body": "Does anyone have a recommendation for a website with a variety, that would not be insanely expensive?"
    },
    {
        "title": "Canned chicken?",
        "author": "AccomplishedEgg9768",
        "timestamp": "2026-02-12T00:01:26+00:00",
        "permalink": "/r/Cooking/comments/1r2e30h/canned_chicken/",
        "body": "So, I’m a frequent flyer of the food bank, which means my options are pretty limited on what proteins I get. Sometimes I get gifted absolute gem cuts, like this past week I got a beautiful flank steak, but unfortunately it’s not thawed all the way through so I have to wait until tomorrow to use it. I do, however have some canned chicken and I was wondering if anyone has any experience with it? Does it have a metallic taste, or weird texture? I’m making Alfredo and it just feels naked without chicken. Is it worth it chat?"
    },
    {
        "title": "Can anyone help me to make a good brownies?",
        "author": "mkyile",
        "timestamp": "2026-02-12T16:48:33+00:00",
        "permalink": "/r/Cooking/comments/1r2yiv3/can_anyone_help_me_to_make_a_good_brownies/",
        "body": "I prefer the wet and dry mix since I like the glossy top and the chewy texture, but honestly, I’m not picky—I’ll happily try any brownie you hand me, no matter how it’s made"
    },
    {
        "title": "Are people washing onions?",
        "author": "ExtensionDot3731",
        "timestamp": "2026-02-11T13:38:04+00:00",
        "permalink": "/r/Cooking/comments/1r1xlou/are_people_washing_onions/",
        "body": "I ponder this question every time I’m about to chop an onion. Me personally? Never. I slice it in half, peel the skin off, brush off the knife, and start chopping away. But I’m curious, do you rinse your onions?\nBonus question - when you cook meat do you have a different utensil for putting it on the grill, cooking it, and taking it off? Or are you taking your cooked meat off the grill with the same pair of tongs you used to put raw meat on it?"
    },
    {
        "title": "Food processor for kneading dough",
        "author": "Temporary_Gas_6407",
        "timestamp": "2026-02-12T13:31:07+00:00",
        "permalink": "/r/Cooking/comments/1r2thgj/food_processor_for_kneading_dough/",
        "body": "Hi.. Need a food processor for kneading dough especially.. Chopping vegetables is a added bonus if I get with it.. This is for Indian home.."
    },
    {
        "title": "does anyone knows the secrete behind how Japanese and Taiwanese able to make their chicken so soft that you don't even have to chew them it just melts in your mouth.",
        "author": "ReCoN_3062",
        "timestamp": "2026-02-11T04:45:03+00:00",
        "permalink": "/r/Cooking/comments/1r1ny5r/does_anyone_knows_the_secrete_behind_how_japanese/",
        "body": "Hii everyone!\nFull context: i was in taiwan for last 3 weeks and i really liked their fried chicken and chicken breast ramen like it was so soft that i dont even have to put efforts chewing them, whereas in india chicken is kind of rubbery where you have to chew a lot to break it down.\ni wanted to know is Taiwanese chicken any different than indian one XD or there is some secrete cooking technique they use to make the chicken super soft because i want to replicate their style here in india as i miss those so hard QQ.\nSample image:\nhttps://drive.google.com/file/d/1aKM9yFGEDAtZsCkqkS6W4QhGukymqOzF/view?usp=sharing\nEdit: Dam thanks everyone for your valuable insights!! i'll definitely read every single comment <3"
    },
    {
        "title": "What's a good main dish to pair with lasagna? We're having a birthday party for our supervisor who loves Italian. There's 7 of us so I'm not sure just 1 lasagna is enough. I'm making it from scratch but I thought maybe chicken Alfredo also? There's also salad and garlic bread. Or is 1 lasagna enough",
        "author": "nrkelly",
        "timestamp": "2026-02-11T18:37:22+00:00",
        "permalink": "/r/Cooking/comments/1r25l76/whats_a_good_main_dish_to_pair_with_lasagna_were/",
        "body": ""
    },
    {
        "title": "Looking for a good rice cooker with steaming function",
        "author": "Wolkenschwinge",
        "timestamp": "2026-02-12T12:34:25+00:00",
        "permalink": "/r/Cooking/comments/1r2s939/looking_for_a_good_rice_cooker_with_steaming/",
        "body": "Hi :)\nI’ve been getting more and more into cooking lately. For years I was mostly the “heat up ready-made meals” type.\nI’d love a rice cooker because I really hate cooking rice, but I’d like to eat it more often. Right now my go-to side for most meals is usually just pasta.\nIf a device could take that off my hands and maybe also steam vegetables, or even cook potatoes, that would be amazing. I’d also really like to make sushi. In general, I love Asian food.\nIdeally I want something that’s as low-effort as possible.\nWhen I make rice at the moment, I usually mix it with vegetables that I pan-fry, then add tomato sauce, soy sauce, or a creamy sauce.\nFrom a quick Google search, I keep seeing Zojirushi and Tiger.\nAre those really the gold standard and worth investing in right away, or is that overkill for someone who’s still a bit of a beginner in the kitchen?\nThey also seem harder to get in Germany (my country), and I’m wondering if as a beginner I’d even notice the differences.\nI’m willing to spend more if it genuinely adds value. Main thing is I want to cook a wider variety of meals :)\nWould love to hear your thoughts."
    },
    {
        "title": "What dishes should I cook with shrimp, octopus,oysters and squid?",
        "author": "Satanic_Jellyfish",
        "timestamp": "2026-02-12T18:31:03+00:00",
        "permalink": "/r/Cooking/comments/1r31c2k/what_dishes_should_i_cook_with_shrimp/",
        "body": "Bought a mix with these marine products and want to cook something interesting, probably Asian food (no culture/country preference). I would be really grateful if someone would give me suggestions or helpful online resources. I am in a really small town and there is no dedicated shop for Asian ingredients so I don’t think I can get rare ingredients. Thanks in advance for any comments ))"
    },
    {
        "title": "Do you have to use Dutch oven to make braised beef dishes?",
        "author": "Ok-Entrance6105",
        "timestamp": "2026-02-12T05:28:30+00:00",
        "permalink": "/r/Cooking/comments/1r2l2mz/do_you_have_to_use_dutch_oven_to_make_braised/",
        "body": "I keep seeing recipes for braised beef dishes and it looks like such a simple dish to make in terms of the ingredient list. It takes some time, but it seems like a low effort dish for the most part.\nI dont own a dutch oven which is what I see used in a lot of these videos. Can I just use stainless steel as long as it has a lid?\nAlso, I wouldnt mind seeing some more recipes if you guys have any. I really want to try making it sometime.\nCheers.​"
    },
    {
        "title": "Need simple but fun/involved recipe ideas for a couple who have 5 nights in a nice-sized kitchen (compared to ours) on a budget, with very little idea what spices, etc. will be available",
        "author": "JabasMyBitch",
        "timestamp": "2026-02-12T18:26:24+00:00",
        "permalink": "/r/Cooking/comments/1r317dy/need_simple_but_funinvolved_recipe_ideas_for_a/",
        "body": "My husband and I are going to be pet-sitting for a stranger who has a nice, big kitchen compared to our tiny, bathroom-sized one. We want to take advantage of this and cook some nice meals together that are not fun/almost impossible to do together in our own kitchen.\nThe problem is that we don't know what spices, vinegars, oils, pastes, etc. will be available. We will be getting our shopping done on the way there on the last leg of our journey into the countryside on a train, so we won't be able to have a look around to decide what we have to work with beforehand. And we also don't want to spend the money on buying a bunch of these things when we will only be using small amounts of and won't be able to bring everything back, as we are traveling by train with a couple backpacks.\nSo far we are thinking sheperds/cottage pie, because tomato paste and worcester sauce is easy to carry with us (or home with us) and the rest is easy ingredients that won't go to waste, but I am blanking on other ideas. My husband suggested home-made kebabs or gyros, but again, we have no idea what spices there will be to use!\nOf course we can do very simple things, like bangers and mash with the potatoes we will already be buying for the pie, or a fry up (but we already do that a lot at home), but we would like something more involved aside from cutting up potatoes and frying some sausages. But again, without too many ingredients!\nThank you for an insight or ideas you have!"
    },
    {
        "title": "What is a good dairy substitute for coconut cream?",
        "author": "burnt-----toast",
        "timestamp": "2026-02-12T18:23:04+00:00",
        "permalink": "/r/Cooking/comments/1r3140s/what_is_a_good_dairy_substitute_for_coconut_cream/",
        "body": "I am looking at a roasted sweet potato recipe that gets topped with a lime cream and cilantro. It isn't explicitly a vegan recipe, but from looking at other recipes on the site, I am guessing that it may be a vegan website? I am not vegan, and I am also not familiar with coconut cream, so I am wondering if there is any way of using a dairy substitute, like maybe heavy cream, instead? The coconut cream gets mixed with lime juice, chilled, and then drizzled(?) dolloped(?) on top of the sweet potatoes. Would this be more viscous than heavy cream but more neutral in flavor (less sour) than sour cream?"
    },
    {
        "title": "Tahini butter vs Peanut butter",
        "author": "Fudgeman48",
        "timestamp": "2026-02-12T18:03:42+00:00",
        "permalink": "/r/Cooking/comments/1r30kpo/tahini_butter_vs_peanut_butter/",
        "body": "I’m making candy using my grandmas recipe which only calls for peanut butter. Then I wondered how would it taste using tahini paste. In your opinion for desserts which would you prefer when pairing with chocolate and why? Btw her recipe contains a decent amount of sugar so both will be sweetened"
    },
    {
        "title": "How to nicely plate ravioli with plenty of sauce?",
        "author": "Kesse84",
        "timestamp": "2026-02-12T14:06:44+00:00",
        "permalink": "/r/Cooking/comments/1r2ubu8/how_to_nicely_plate_ravioli_with_plenty_of_sauce/",
        "body": "I am making square mushroom ravioli with cream and pecorino reduction. I will be serving it on grey rectangular plates. I have tried various options trying to plate it nicely, but it always looks like a baby vomited on it.\nThe last time I was asking about removing air from ravioli, I attached a photo, and everybody were comenting on the plating (instead of answering a question)."
    },
    {
        "title": "Pork shoulder left out - safe to cook?",
        "author": "NothingLikeCoffee",
        "timestamp": "2026-02-12T17:14:50+00:00",
        "permalink": "/r/Cooking/comments/1r2z8tm/pork_shoulder_left_out_safe_to_cook/",
        "body": "I made a stupid mistake earlier and set up my slow cooker and turned the switch but forgot to plug it in. (No power indicator on it.) It has sat for about 3 hours.\nIf I turn it on do ya'll think it would be okay or should I just chuck it?"
    },
    {
        "title": "Homemade mushroom powder",
        "author": "Captain_Jack_Aubrey",
        "timestamp": "2026-02-12T01:46:11+00:00",
        "permalink": "/r/Cooking/comments/1r2gggg/homemade_mushroom_powder/",
        "body": "Just wanted to share an incredibly simple but amazing ingredient I made a while back. I always felt bad throwing out shiitake stems when cooking, since it seemed a tad wasteful even though they’re generally too tough to eat. One night, I took a big pile of stems I had left over while the rest of dinner cooked and sliced them lengthwise into halves or quarters. I tossed them into my dehydrator for a few hours, then ran them through my (cleaned) coffee grinder.\nWhat resulted was the fluffiest powder I’ve ever seen, almost a like powdered sugar. It’s also one of the most versatile and delicious things I have in my seasoning cabinet now. Whenever I make a sauce, stew, gravy, or similar, I add a tablespoon or so of this stuff. It’s an amazing thickener, and a huge hit of umami. The only downside is that if you don’t dump it in a bit quick, the hot air rising from the pan can sometimes carry some of the mushroom powder away!"
    },
    {
        "title": "Whats food thats look extremely tasty and comfy?",
        "author": "Few-Track8525",
        "timestamp": "2026-02-12T20:12:30+00:00",
        "permalink": "/r/Cooking/comments/1r342p1/whats_food_thats_look_extremely_tasty_and_comfy/",
        "body": "I mean food that looks like you would immediately eat it on a cold winter day, which fills your gut and looks so so comfy. I got two examples, first\nthis video\nat 6:26 and secondly\nthis video\n. I wanted to post pictures but... isnt possible here somehow. Anyway, I would love it so much if you posted your own recipes and maybe pictures. Other recipes and pictures are of course also welcome! Thank You!"
    },
    {
        "title": "Check With your Local Library for Free NYT Cooking Access",
        "author": "cixelsyd",
        "timestamp": "2026-02-11T18:34:19+00:00",
        "permalink": "/r/Cooking/comments/1r25i9l/check_with_your_local_library_for_free_nyt/",
        "body": "All, I recently discovered that I can get access to all NYT online content, including Cooking, through my local library (both city and county systems offer the same access). I click a link on my library's Online Resources/Magazines & Subscriptions page, and it gives me 3-days of full access to NYT online content and can be repeated indefinitely.\nI'd been hesitant to pay for NYT Cooking access in the past, so this is a game changer. I'm super stoked and already trying two of their recipes (new to me) this week.\nLink\nfor those of you curious how it is set up for the San Diego county library system."
    },
    {
        "title": "Award Winning Turkey and Vegetable Chilli Recipe",
        "author": "CanadianRedneck69",
        "timestamp": "2026-02-12T18:58:22+00:00",
        "permalink": "/r/Cooking/comments/1r32334/award_winning_turkey_and_vegetable_chilli_recipe/",
        "body": "-one diced orange bell pepper\n-one diced red bell pepper\n-one diced yellow bell pepper\n-one diced green pepper\n-3 jalapenos\n- 4 ribs of diced celery\n-2 large carrots diced\n-can of green hatch chillies\n-2 onions diced\n-2 cans of chipotle in adobo blended\n-whole head of garlic diced\n-salt\n-pepper\n-garlic powder\n-cumin\n-chili powder\n-cocoa powder\n-paprika\n-can of kidney beans\n-can of black beans\n-can of chick peas\n-maple syrup\n-3 pounds of ground turkey browned in batches in cast iron pan\n-can of tomato paste\n-3 cans of Rotel diced tomatoes\nServed with diced cheese curds mixed in and chopped jalapenos and sour cream with lime juice on the side"
    },
    {
        "title": "What wood be a good primi ?",
        "author": "Kesse84",
        "timestamp": "2026-02-12T11:16:06+00:00",
        "permalink": "/r/Cooking/comments/1r2qs5z/what_wood_be_a_good_primi/",
        "body": "Os, since some of you guys are very strict - I have an idea for a main course and dessert, but I need something for a starter or a soup.\nMushroom ravioli and pecorino romano reduction is main and tiramisu is for dessert."
    },
    {
        "title": "A quaint 60yo promotional video from LaChoy with demonstrated recipes",
        "author": "kempff",
        "timestamp": "2026-02-11T22:01:18+00:00",
        "permalink": "/r/Cooking/comments/1r2b2v6/a_quaint_60yo_promotional_video_from_lachoy_with/",
        "body": "https://www.youtube.com/watch?v=rhLLHTsE7Pg\nDon't get your bloomers in a bunch over stereotypes, remember this is 1964 and the target audience is traditional housewives raising their baby boomer children on the man's salary.\nThe agenda is to popularize Chinese-influenced food and show off how easy it is to integrate a \"rare combination of foods that are so readily available for Chinese cookery\" into the American menu, with La Choy brand ready to meet the market demand with its line of canned products. Was this subversion by the \"Red Chinese\" cleverly disguised as marketing? lol ... but TikTok was to debut 52 years later ...\nThe video reassuringly stresses the modernity and sanitation of the production process. This was a concern when considering \"foreign\" or \"exotic\" foods.\nThe chef character cites the yield at the start of each of his demonstrated recipes. Put yourself in the housewife's position: \"four to six servings\" ... why, the recipe would be perfect for your nuclear family!\nShowcasing La Choy brand \"Chinese\" food thoroughly Americanized so as to be intriguing yet accessible, the recipes are simple and straightforward, eminently doable in any American kitchen. Other than soy sauce and bean sprouts, nothing is particularly \"foreign\" or \"exotic\"; the chef even calls his wok a \"Chinese cooking pan\".\nNice cameo by old-school Pyrex measuring pitcher!\n\"Thirty minutes? My customers are going through the roof right now! In thirty minutes they'll be in orbit!\" The waiter character uses the word \"orbit\", because of course he does. It was '64, we were in the middle of a Cold War and a Space Race; everybody knew the scientific technical term \"orbit\".\nI appreciate the chef explaining that chop suey is not Chinese at all.\nIncidentally I also noticed, because this is\n/r/Cooking\nafter all, that neither the chef character, nor the \"girl\" character who demonstrates more recipes in the second half, whatever role she plays in the restaurant, doesn't use excessive heat, the bane of so many amateur home cooks, even in his \"Chinese cooking pan\".\nWhen the waiter character objects the recipes look like they can't be done in a typical American kitchen, the chef holds up one of those \"handy sealed containers\", cans, obviously, but if you look closely it's a special can. It's actually two cans taped together, something La Choy pioneered for its canned Chow Mein product. The meat and sauce were in the smaller can on top and the vegetables in the larger on the bottom. Was this borne of production logistics, or was it a Bernays-style \"add an egg\" ploy to make the American housewife feel she's actually cooking rather than just opening a can?\nOh look, La Choy even has a recipe and suggestion book! Where can I get one?\nThe remaining demonstrated recipes are done in a modern American kitchen. No \"Chinese cooking pans\".\nYMMV but that bacon-wrapped water-chestnut, pineapple, and chicken liver plate would be perfect for Bridge Night. I need to get multi-colored toothpicks.\nThe girl character sings the virtues of \"Chinese\" food as low-calorie (yes they had diet fads aplenty even then) and high in protein, but also as a \"meat-stretcher\", not some device that you'd prank the FNG with but something to add meat to to make a fuller meal, like Hamburger Helper was to do in the early 1970s.\nSpeaking of dietary fads, keep an eye out for sugar in the recipes. After Ike had his heart attack in '55 there was a massive push to vilify fat and lionize sugar, as Adam Conover would be happy to ruin for you.\nAdditionally, mentioning she can get all the provisions she needs for dinner in one place, even one shelf, surely takes the drudgery out of shopping for your family. No need to make separate stops at the butcher and greengrocer (which was a thing in the '60s before the all-in-one \"Super-Market\" became the norm).\nThe background music switches from traditional Chinese-style music to flutey jazz for the rest of the video. This is the hardcore-sell part of the video where the girl demonstrates some serious Chinese-influenced recipes that the American housewife can realistically use.\nThe \"sumptuous\" Mandarin salad looks positively awful, ngl. And mayonnaise? Always with the mayonnaise. Nice cameo by a yellow Pyrex glass mixing bowl, though. Those go for a pretty penny at mid-century antique malls.\nCheck out the Hall Rose Parade pitcher to the left of the coffee station!\nScrambled eggs \"\nOrientale\n\"? French-Asian fusion egg foo young? What would Jacques Pepin think?\nIdk about boiling chicken for what basically amounts to a chicken stew, but ... Hello Revere Copper Clad saucepan!\nCute ending, waiter wants to take girl on a dinner date, but with Women's Lib just around the corner she insists on making it herself for them at her place. Chinese pizza? I'm intrigued...\nSomeone once said that immigrants conquer us with their food.\nBut my favorites pieces of trivia about La Choy brand specifically are (1) La Choy was started by Ilhan New and Wally Smith, and (2) The three owners of La Choy, all Americans, appeared on\nWhat's My Line\nand nobody guessed they made Chinese food!"
    },
    {
        "title": "I need to figure out how to cook several beginner meals to rotate in the week. Please read inside.",
        "author": "mr-bonsai-",
        "timestamp": "2026-02-11T23:13:43+00:00",
        "permalink": "/r/Cooking/comments/1r2cxwh/i_need_to_figure_out_how_to_cook_several_beginner/",
        "body": "I'm 35 and I've never cooked a meal in my life. I've prepared sandwiches and made things like scrambled eggs, but never cooked a full meal like starting with the raw meat and cooking it.\nMy mother has always cooked for me. I live with her but she's old now and she experiences hair loss. I've been having a hard time eating what she makes because I almost always find hair in the food. She seems to have a hard time accepting that.\nAnyway, we concluded today that she would no longer cook for me and I will start to cook for myself. She's not going to be teaching me how. She's not good at teaching and is very impatient and has an anger problem and it's physically taxing for her to stand behind me to show me things.\nI don't even know where to get started. I could just buy several loafs of bread to go through in a week and eat non-stop sandwiches, but I'd rather not have to live like that.\nWhat are the simple and basic meals I can prepare for myself regularly to rotate in the week to keep me steady until I can learn more later?\nPlease just provide me with whatever info you think helps.\nThanks for your help!\nEDIT: To give you guys an idea of what I like to eat since a lot of you are asking -\nI do eat meat but I am moving away from red meat and cheeses. I've considered becoming a vegetarian for health reasons, particularly high cholesterol. I may just stick to chicken and fish because I think veggie only would be highly restrictive... let's just say 80% veggie and 20% meat. I don't eat pork meat.\nI do enjoy eating tacos a lot. I never really seem to get sick of them. So I'll most likely eat variations of tacos each week.\nI do like pastas when done right.\nI enjoy a lot of Asian cuisine as well so sushi.\nI do like to eat things with potatoes. I love a baked potato with sour cream as well.\nI don't really care for rice.\nHope that gives an idea.\nEDIT 2: Thank you all immensely for all these super helpful responses. A lot of you are really kind. I have read every single one and will be using it to help me prepare meals!"
    },
    {
        "title": "What’s a simple meal you make when you don’t want to think?",
        "author": "SetDesigner1586",
        "timestamp": "2026-02-12T02:12:49+00:00",
        "permalink": "/r/Cooking/comments/1r2h1jf/whats_a_simple_meal_you_make_when_you_dont_want/",
        "body": "Some days I want food with minimal brain power. Curious what people’s go-to lazy meals are."
    },
    {
        "title": "Pink Garlic Powder Recipe Suggestions",
        "author": "Sully_Writes",
        "timestamp": "2026-02-12T06:31:07+00:00",
        "permalink": "/r/Cooking/comments/1r2m6uh/pink_garlic_powder_recipe_suggestions/",
        "body": "My wife got me a nice tin of pink garlic powder for valentines. I usually make us a multi course meal for special occasions and am looking for ideas to really put this gift front and center. I'm unfamiliar with pink garlic, but have tasted it and it's really lovely. Having access to only the powder rules out a lot of garlic forward recipes that I'm familiar with, so I thought I'd ask the great hive mind their thoughts.\nI'm just an amateur cook but I haven't found many dishes I can't at least get close enough to right. One thing I thought of though that I am less practiced at is homemade pasta. Would introducing garlic powder to the pasta itself cause integrity issues? Would it even make a meaningful difference flavor wise?\nI'm looking for ideas, brainstorming, recipes, history; anything. Bonus points if the concept can produce a nice pink color to give an extra nod to the seasoning. I love this woman with all my heart, and times have been a bit tough lately with my depression. Cooking used to be such a passion for me and I've really been phoning it in lately. I want to pull out all the stops for this dinner.\nPlease and thank you, Reddit.\nSully"
    },
    {
        "title": "Chicken thighs like being cooked on top of root vegetables",
        "author": "Crafterandchef1993",
        "timestamp": "2026-02-12T01:09:40+00:00",
        "permalink": "/r/Cooking/comments/1r2fngx/chicken_thighs_like_being_cooked_on_top_of_root/",
        "body": "So I was making chicken thighs with roasted root vegetables. But I suddenly was out of energy, so I decided to cook them together in the air fryer so I could sit down. Definitely recommend. The skin was rendered and crispy and the meat was tender and succulent. 10/10 would recommend and will definitely do again"
    },
    {
        "title": "Fool magazine and Lucky peach",
        "author": "dadofonegirl",
        "timestamp": "2026-02-12T19:05:19+00:00",
        "permalink": "/r/Cooking/comments/1r32a3b/fool_magazine_and_lucky_peach/",
        "body": "I have a complete set of Fool and select issues of lucky peach, unsure what to do with these anymore\nSell? Keep?"
    },
    {
        "title": "Tools that elevated my home cooking completely",
        "author": "Sophistry7",
        "timestamp": "2026-02-12T01:30:32+00:00",
        "permalink": "/r/Cooking/comments/1r2g42o/tools_that_elevated_my_home_cooking_completely/",
        "body": "Is investing hundreds in quality utensils cook really necessary or just pretentious for a home cook? I've cooked with cheap dollar store tools my entire adult life and survived without any major disasters or injuries. My friend who's a chef insists proper tools transform cooking but she cooks professionally so of course she would say that naturally. Would better spatulas and knives actually improve my mediocre cooking skills or is that wishful thinking? My family doesn't complain about my meals so maybe my tools are adequate for our needs already. The cost of replacing everything properly would be significant, easily five hundred dollars for basics which seems excessive. That money could go toward groceries for months instead of tools that might not make any noticeable difference. My cheap knives are dull but they still cut eventually with enough effort and pressure applied. My spatulas bend but they still flip pancakes even if it's awkward and frustrating sometimes. Is my frustration worth hundreds of dollars or should I just accept cooking isn't my passion and adequate tools are sufficient? My sister upgraded her kitchen and raves about the difference constantly saying she actually enjoys cooking now. Maybe there's something to this that I'm dismissing too quickly without properly considering the benefits. Quality tools supposedly last decades while I replace my cheap ones annually which adds up over time financially. I found professional kitchen tools on Alibaba at reasonable prices but I'm still debating if this is justifiable."
    },
    {
        "title": "Frozen hooves for soup",
        "author": "TheLonePig",
        "timestamp": "2026-02-12T12:03:09+00:00",
        "permalink": "/r/Cooking/comments/1r2rmsy/frozen_hooves_for_soup/",
        "body": "A while back I got a bag of frozen hooves (beef or pork, can't remember) in the meat dept of Walmart. I made a really gelatinous bone broth with it in the instant pot. I can't find this, or any similar product anymore, in person\nor even online\n. I can find like, whole pig trotters that look like actual pig feet, but the product I'm looking for was more like white and sliced into discs and not awful to look at lol.\nAnyone know what I'm talking about or where to get them? I swear I'm not delusional."
    },
    {
        "title": "Ranch powder on oven baked chicken wings?",
        "author": "West-Television6252",
        "timestamp": "2026-02-11T21:06:01+00:00",
        "permalink": "/r/Cooking/comments/1r29mf7/ranch_powder_on_oven_baked_chicken_wings/",
        "body": "I’ve been making oven baked chicken wings recently and I’m loving them. I also love ranch (especially using the powder in cooking). Do you think it would be good to put the ranch powder on the wings with the baking powder before baking them in the oven for more flavor??"
    },
    {
        "title": "For any parents out there of picky eaters, what are ways you sneak vegetables into their diet?",
        "author": "Happy-War-7257",
        "timestamp": "2026-02-12T17:19:27+00:00",
        "permalink": "/r/Cooking/comments/1r2zdam/for_any_parents_out_there_of_picky_eaters_what/",
        "body": "My kids are extremely picky eaters, I have 1 that’s braver than the others but overall the verdict is vegetables are gross. I know every kids hates vegetables but if they even see the color green they won’t eat it. Does anyone have any tricks they pull or recipes that contain vegetables I could make without them knowing? Additionally I’m trying to increase the variety of meals at home so any recipes that were a surprise home run with picky eaters would also be greatly appreciated."
    },
    {
        "title": "Significant texture change in Scanpan Classic (2017 vs. 2026 Stratanium) – Is this normal?",
        "author": "AdventurousGlass9743",
        "timestamp": "2026-02-12T06:31:50+00:00",
        "permalink": "/r/Cooking/comments/1r2m7bz/significant_texture_change_in_scanpan_classic/",
        "body": "I’ve been using a\nScanpan Classic 11\" Wok\nsince 2017. My original pan had a very smooth, almost glass-like ceramic titanium finish.\nI just bought a brand new replacement, but the surface is completely different. It has a\nvery rough, sandpaper-like texture\n(it feels like a fine grit). I know Scanpan moved to the\nStratanium\ncoating a few years ago, but I wasn't expecting this much of a tactile change.\nFor those who have made the switch from the older smooth pans to the newer Stratanium models:\nIs this level of roughness normal?\nIt’s textured enough that it actually catches fibers from a paper towel when I wipe it.\nDoes the \"grit\" wear down?\nDoes it eventually smooth out with use, or is it designed to stay this way for the life of the pan?\nPerformance Check:\nHave you noticed better searing with this texture, or does the \"roughness\" make it feel less non-stick than the old smooth versions?\nI want to make sure I didn't get a defective unit before I start cooking with it. Thanks for the help!"
    },
    {
        "title": "Would freezing Napa Cabbage ruin it?",
        "author": "LittleChibs",
        "timestamp": "2026-02-11T21:55:34+00:00",
        "permalink": "/r/Cooking/comments/1r2axej/would_freezing_napa_cabbage_ruin_it/",
        "body": "I'm in charge of meal planning and cooking most days in my house and one of the recipes I have planned it Cabbage Rolls, but I'm making that later in the week. Would freezing the napa cabbage ruin it to where it wouldn't be usable for cabbage rolls anymore? I'm still relatively new to cooking."
    },
    {
        "title": "Spaghetti meatballs",
        "author": "Unique-Display7234",
        "timestamp": "2026-02-12T09:44:35+00:00",
        "permalink": "/r/Cooking/comments/1r2p9ik/spaghetti_meatballs/",
        "body": "Please fellow redditors, what is your secret to the perfect spaghetti meatballs?\nI always find my meatballs don’t maintain integrity during the cooking process and fall apart or they stay in shape but are hard and dry. What are your tips and tricks to the perfect classic spaghetti meatballs. Also would like to know your recipes if you are happy to share.\nThanks in advance."
    },
    {
        "title": "Ideas for braised short rib upgrade or deviation",
        "author": "Primary_Smell_1447",
        "timestamp": "2026-02-12T03:45:13+00:00",
        "permalink": "/r/Cooking/comments/1r2j1mx/ideas_for_braised_short_rib_upgrade_or_deviation/",
        "body": "Partner asked for braised short rib for our valentines meal. Have made it couple times before using a basic beef-stock, red wine braise and feel like it’s a little boring (still delicious) and am looking for ways to upgrade it.\nHow can I jazz it up? Is there anything similar  that you would recommend that I can try?\nAny fun sides you have made to accompany it? Don’t love mashed potatoes"
    },
    {
        "title": "Is slow-cooking braised short ribs for 10-12 hours in the oven at 95 degrees celsius / 200 Fahrenheit going to retain the moisture and texture without drying out?",
        "author": "NoPlastic5338",
        "timestamp": "2026-02-11T20:02:28+00:00",
        "permalink": "/r/Cooking/comments/1r27xgx/is_slowcooking_braised_short_ribs_for_1012_hours/",
        "body": "I am cooking braised short ribs for a valentine’s day dinner at home this year, but I am working 8 hours during the day. I was thinking what if I braised the short ribs before leaving for work and leaving them in the oven until I come back home? I’ve cooked this dish before but with cook times varying between 4-7 hours at a higher temperature, so I am questioning if this effort could be pulled off without sacrificing the quality of the outcome?"
    },
    {
        "title": "Need to wash veggies used for making vegetable stock?",
        "author": "KamtzaBarKamtza",
        "timestamp": "2026-02-12T09:19:55+00:00",
        "permalink": "/r/Cooking/comments/1r2ow16/need_to_wash_veggies_used_for_making_vegetable/",
        "body": "My wife and I both cook. In the interest of saving money I've decided that I'd like to start making my own vegetable broth by collecting discarded skins and other vegetable scraps used for other purposes in the kitchen. I asked my wife that when she's cooking she should save any parts of a vegetable she would otherwise discard so I could use it for broth.\nShe replied saying that she doesn't like the idea of using these discards for broth because it's utilizing parts of the vegetable that haven't been washed, i.e. peeled potato skins, onion skins, heels of celery, etc.\nWhat are your thoughts on this? Does the fact that the vegetable scraps are unwashed make them unusable for broth?"
    },
    {
        "title": "Beginner cookbooks recs?",
        "author": "realjonny64",
        "timestamp": "2026-02-12T01:24:46+00:00",
        "permalink": "/r/Cooking/comments/1r2fzkq/beginner_cookbooks_recs/",
        "body": "I want to learn to cook a bit better by trying out new recipes and I thought a cookbook would be a fun way to do that! Looking for a solid cookbook with a variety of recipes that are relatively beginner friendly, pls send any recs!!"
    },
    {
        "title": "Looking to find out what in this sauce turns red to orange/yellow",
        "author": "m4nymoons",
        "timestamp": "2026-02-12T08:42:47+00:00",
        "permalink": "/r/Cooking/comments/1r2oba0/looking_to_find_out_what_in_this_sauce_turns_red/",
        "body": "I have recently been craving the Chez Katu sauce, and unfortunately the place closed down. I’ve been hoping to replicate the sweet sauce, and I remember the sauce turning orange/yellow when acid like vinegar was mixed into it. What is this reaction from?"
    },
    {
        "title": "Broth question/not sure if it's the right sub",
        "author": "Icy_Caramel_9850",
        "timestamp": "2026-02-12T08:40:21+00:00",
        "permalink": "/r/Cooking/comments/1r2o9yu/broth_questionnot_sure_if_its_the_right_sub/",
        "body": "Not even sure if this is a question for a nutritionist lol. I often make broth from scratch and buy one that's pretty natural, it's not cheap, where I live things are pretty regulated.\nMy question is: it ok to use broth every single day? I'll use it even to cook onions faster."
    },
    {
        "title": "Help with a ginormous pickled cabbage",
        "author": "jc-5h20",
        "timestamp": "2026-02-11T17:08:22+00:00",
        "permalink": "/r/Cooking/comments/1r232et/help_with_a_ginormous_pickled_cabbage/",
        "body": "Hey, all — A friend gave us a LOT of pickled vegetables from his garden. The problem is we do not eat any of this stuff. Anyway, one of the items is a full and very large cabbage head.\nWe are having company this weekend and I was wondering if we can use it as part of a corned beef and cabbage meal. In the past, I neutralized the vinegar before using it for a soup. And that worked, with some fiddling. But it this case, the corned beef actually cooks in pickling spices, so I was wondering if we could just heat the cabbage separately and serve it.\nI have no idea what I am doing. So any help would greatly be appreciated (besides telling my husband to NEVER accept a bounty like this again — we just eat so differently than this friend does and it feels wasteful).\nAny other ideas of what to do with several quarts of pickled vegetables would also be welcome!"
    },
    {
        "title": "Hard to chew homemade deserts or snacks?",
        "author": "RandomName315",
        "timestamp": "2026-02-11T20:28:03+00:00",
        "permalink": "/r/Cooking/comments/1r28m3h/hard_to_chew_homemade_deserts_or_snacks/",
        "body": "Hello,\nI'm looking for ideas and recipes for deserts or snacks that are NOT \"melt in your mouth\", but that take a reasonable effort to chew. And good enough to be worth the effort.\nAny ideas?"
    },
    {
        "title": "Anyone used Tallow to fry fish?",
        "author": "National-Attention-1",
        "timestamp": "2026-02-12T16:27:31+00:00",
        "permalink": "/r/Cooking/comments/1r2xyod/anyone_used_tallow_to_fry_fish/",
        "body": "I'm at my wits end trying to fry fish and I'm coming across trying something I've never thought to do before- using fat. Like Tallow or Lard. Every other oil I've tried has burned the outside breading of the fish before the inside could get done enough, so I'm opting to baking the fish the rest of the way. I use thermometers but maybe I also need a new deep fryer... anyways has anyone cooked fish in tallow or lard, and if so how did you like it? Was it too greasy? Tips?\nAlso any tips about how to cook the inside of the fish better is appreciated :("
    },
    {
        "title": "Looking for advice for building out a meal. Jalapeno popper mac and cheese",
        "author": "Acheron223",
        "timestamp": "2026-02-12T03:32:40+00:00",
        "permalink": "/r/Cooking/comments/1r2isny/looking_for_advice_for_building_out_a_meal/",
        "body": "So the plan is a fairly basic base mac and cheese with extra added cream cheese, chopped fresh jalapeno, crispy bacon mixed through, a heavy breadcrumb crust with a thin layer of pickled jalapeno coins over the top. Can you think of anything else to add or any side dish I should do with it?"
    },
    {
        "title": "BRUSSELS SPROUTS",
        "author": "kn0ck_0ut",
        "timestamp": "2026-02-10T21:10:47+00:00",
        "permalink": "/r/Cooking/comments/1r1dbgj/brussels_sprouts/",
        "body": "WHAT IS THE SECRET?!?! why do restaurant brussels taste so good and my at home ones taste like dirt?? I follow copy cat recipes for restaurant brussels i’ve had before but they always taste like dirt. what is the secret?!?!?!?!\nETA: the secret was I didn’t know brussels needed prepping. ty to everyone who shared the whole cleaning and prepping stage of cooking brussels. I will be trying this in 30 min!"
    },
    {
        "title": "Wine bar themed dinner party advice",
        "author": "Sea-Trade865",
        "timestamp": "2026-02-12T03:30:44+00:00",
        "permalink": "/r/Cooking/comments/1r2ir6m/wine_bar_themed_dinner_party_advice/",
        "body": "I’m hosting a dinner party for 7 people and want to make it wine bar themed where I serve a bunch of small/shared plates instead of a traditional appetizer, entree, and sides. I built my menu around inspo from restaurants i love and also Molly Baz’s cookbook.\nI’d love to get your thoughts on this menu. Does it feel well rounded? Enough variety? Missing or overdoing anything?\nI would also love any practical tips from someone who has hosted a more ambitious dinner like this. I’ve done more traditional dinner parties in the past, but this is my first time hosting with so many dishes.\nCourse one\n- [ ] Marinated Feta and olives with orange zest\n- [ ] Tinned fish, butter, cornichons\n- [ ] Marinated white beans\n- [ ] Sourdough\nCourse two\n- [ ] Whipped ricotta with honey and olive oil served with focaccia\n- [ ] Citrus salad with burrata\nCourse three\n- [ ] Lemon orzo (molly baz)\n- [ ] Raw and Roasted carrots with cumin, maple syrup, lime juice, and sesame seeds (molly baz)\nCourse four\n- [ ] Lamb meatballs with roasted cabbage and tahini sauce (molly baz)\nCourse five\n- [ ] Orange olive oil cake"
    },
    {
        "title": "Meal ideas for a restricted diet",
        "author": "Infamous-Raccoon-846",
        "timestamp": "2026-02-12T01:09:28+00:00",
        "permalink": "/r/Cooking/comments/1r2fnas/meal_ideas_for_a_restricted_diet/",
        "body": "I would like help planing meals. my doctor recommended going GF, dairy free, and no artificial sweeteners. I’m honestly overwhelmed and trying to see what foods are safe. I’ll have to look at everything but was wondering if anyone has meal or snack recommendations. Thank you!"
    },
    {
        "title": "Best way to make ube flan?",
        "author": "Desperate_Return_142",
        "timestamp": "2026-02-12T03:09:44+00:00",
        "permalink": "/r/Cooking/comments/1r2ib2x/best_way_to_make_ube_flan/",
        "body": "Hi! I've been perfecting my normal caramel flan recipe (Mexican-style, not leche flan) and I want to experiment with different flavors like ube. I saw that there is ube extract, ube condensed milk, and ube halaya. Can I replace the traditional condensed milk for the ube condensed milk, or should I try a few drops of extract? I figure ube halaya is very sweet, but I don't know if I could add that as well. If someone much more experienced than me could help I would really appreciate it!"
    },
    {
        "title": "Pasta troubleshooting",
        "author": "Latranis",
        "timestamp": "2026-02-12T03:08:40+00:00",
        "permalink": "/r/Cooking/comments/1r2ia8n/pasta_troubleshooting/",
        "body": "I had a disaster with making homemade pasta dough tonight, and can't figure out why. I'm an experienced cook, though this is my first foray into homemade pasta.\nFollowing a few recipes I saw, I made a well with three cups (spooned into a one cup measuring cup) all-purpose flour and four eggs. I stopped at three since it overflowed the well and mixed the flour in. It didn't become dough at all, but basically egg drop soup on my counter. I had to add more and more flour to simply make the dough. I finally got it to form a dough using all four eggs and probably another cup of flour, and let it rest. No matter what I did, it fell apart in the pasta roller. Added water, even a drop of oil, and it still fell apart, even when the consistency seemed right. I finally gave up and cut some strands just to try it, put it in salted water, boiled for two minutes, and....nothing. It dissolved into the water entirely, not a single strand was left, simply dough water.\nWhat went wrong? Could the flour be bad?"
    },
    {
        "title": "Finish the sentence - what was he trying to make?",
        "author": "evan938",
        "timestamp": "2026-02-12T16:26:25+00:00",
        "permalink": "/r/Cooking/comments/1r2xxn3/finish_the_sentence_what_was_he_trying_to_make/",
        "body": "My friend, who is a single, mid-30s male with a PhD, sent a group text this image and caption today.\nBased on the image, I want reddit to guess what the attempted final product was 😂😂😂\nhttps://imgur.com/a/0Xr6WfZ"
    },
    {
        "title": "Advice / Feedback on Nepalese Aloo Cheese Momos",
        "author": "ReceptionExpert9991",
        "timestamp": "2026-02-12T06:38:58+00:00",
        "permalink": "/r/Cooking/comments/1r2mbmy/advice_feedback_on_nepalese_aloo_cheese_momos/",
        "body": "Tl;dr:\nPracticing making aloo cheese momos for my girlfriend for Valentine’s Day. Any advice or feedback would be appreciated!\nPictures here because I can’t post them:\nhttps://imgur.com/a/jbVotIh\nHi everyone! I’ve never been to Nepal, but my girlfriend has; she always talks about how “potato and cheese momos” from there are the best thing she ever eaten. We can’t find anywhere near us that sells them, so I thought I’d try to make some for her for Valentine’s Day. I’m just looking for some advice or feedback on how these turned out. I’ve never had them before, so I don’t know what they’re supposed to look or taste like (obviously you can’t taste them unfortunately! 😅). I’ve asked a couple of people and was told that the recipe I used is most likely to be similar to what she would have had while backpacking there. I’m worried they won’t be anything like she remembers though! If anyone happens to have been to / lives in Nepal and knows exactly what she may be referring to when she says, “potato and cheese momos”, I’d love your advice! Thank you! ☺️\nI tried posting in [\nr/Nepal\n](\nr/Nepal\n) but got auto modded for posting about relationships lol"
    },
    {
        "title": "Need some serious help",
        "author": "leightonorr1",
        "timestamp": "2026-02-12T02:48:22+00:00",
        "permalink": "/r/Cooking/comments/1r2hty2/need_some_serious_help/",
        "body": "Recently had to move out on my own due to circumstances at home not working well, I am struggling a lot with bills and rent, I have no microwave/toaster etc. what are some cheap things I can get to survive until I correct this awful course I’ve been set on? I’m based in the uk\nThankyou"
    }
]